var rogue = {
    "class": "rogue"
    , "description": [{
        "title": "Rogues"
        , "body": "Rogues rely on skill, stealth, and their foes’ vulnerabilities to get the upper hand in any situation. They have a knack for finding the solution to just about any problem, demonstrating a resourcefulness and versatility that is the cornerstone of any successful adventuring party."
    }, {
        "title": "Skill and Precision"
        , "body": "Rogues devote as much effort to mastering the use of a variety of skills as they do to perfecting their combat abilities, giving them a broad expertise that few other characters can match. Many rogues focus on stealth and deception, while others refine the skills that help them in a dungeon environment, such as climbing, finding and disarming traps, and opening locks. When it comes to combat, rogues prioritize cunning over brute strength. A rogue would rather make one precise strike, placing it exactly where the attack will hurt the target most, than wear an opponent down with a barrage of attacks. Rogues have an almost supernatural knack for avoiding danger, and a few learn magical tricks to supplement their other abilities."
    }, {
        "title": "A Shady Living"
        , "body": "Every town and city has its share of rogues. Most of them live up to the worst stereotypes of the class, making a living as burglars, assassins, cutpurses, and con artists. Often, these scoundrels are organized into thieves’ guilds or crime families. Plenty of rogues operate independently, but even they sometimes recruit apprentices to help them in their scams and heists. A few rogues make an honest living as locksmiths, investigators, or exterminators, which can be a dangerous job in a world where dire rats—and wererats—haunt the sewers. As adventurers, rogues fall on both sides of the law. Some are hardened criminals who decide to seek their fortune in treasure hoards, while others take up a life of adventure to escape from the law. Some have learned and perfected their skills with the explicit purpose of infiltrating ancient ruins and hidden crypts in search of treasure."
    }]
    , "hitPoints": {
        "base": 8
        , "mod": "Constitution"
    }
    , "proficiencies": [{
        "proficiency": "Armor"
        , "ability": [
            "Light Armor"
        ]
    }, {
        "proficiency": "Weapons"
        , "ability": [
            "Simple Weapons"
            , "Hand Crossbows"
            , "Longswords"
            , "Rapiers"
            , "Shortswords"
        ]
    }, {
        "proficiency": "Saving Throws"
        , "ability": [
            "Dexterity"
            , "Intelligence"
        ]
    }, {
        "proficiency": "Skills"
        , "ability": [
            "Acrobatics"
            , "Athletics"
            , "Deception"
            , "Insight"
            , "Intimidation"
            , "Perception"
            , "Performance"
            , "Persuasion"
            , "Sleight of Hand"
            , "Stealth"
        ]
    }]
    , "equipment": [{
        "equipment_type": "Weapons"
        , "primary": [
            "Rapier"
            , "Shortsword"
            , "Shortbow and Quiver"
            , "Two Daggers"
        ]
    }, {
        "equipment_type": "Armor"
        , "primary": [
            "Leather Armor"
        ]
    }]
    , "levelTable": [{
        "level": 0
    }, {
        "level": 1
        , "profiency": 2
        , "features": [
            "Expertise"
            , "Sneak Attack", "Thieves' Cant"
        ]
        , "Sneak Attack": "1d6"
    }, {
        "level": 2
        , "profiency": 2
        , "features": [
            "Cunning Action"
        ]
        , "Sneak Attack": "1d6"
    }, {
        "level": 3
        , "profiency": 2
        , "features": [
            "Roguish Archetype"
        ]
        , "Sneak Attack": "2d6"
    }, {
        "level": 4
        , "profiency": 2
        , "features": [
            "Ability Score Improvement"
        ]
        , "Sneak Attack": "2d6"
    }]
}